Revit 2027 API
LabelUtils.GetLabelFor(PipeLossMethodType, Document) Method
 Gets the user-visible name for a PipeLossMethodType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetLabelFor(
	PipeLossMethodType pipeLossMethodType,
	Document doc
)
Public Shared Function GetLabelFor (
	pipeLossMethodType As PipeLossMethodType,
	doc As Document
) As String
public:
static String^ GetLabelFor(
	PipeLossMethodType pipeLossMethodType,
	Document^ doc
)
static member GetLabelFor :
        pipeLossMethodType : PipeLossMethodType *
        doc : Document -> string
Parameters
pipeLossMethodType PipeLossMethodType
 The PipeLossMethodType to get the user-visible name.
doc Document
 The document from which to get the PipeLossMethodType.
Return Value
String
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when information for the input PipeLossMethodType cannot be found.
Remarks
 The name is obtained in the current Revit language.
See Also
Reference
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace